codinghong666/car/code/H_Group/STC32F.H
typedef struct TAG_PWM_STRUCT
{
    unsigned char CR1;
    unsigned char CR2;
    unsigned char SMCR;
    unsigned char ETR;
    unsigned char IER;
    unsigned char SR1;
    unsigned char SR2;
    unsigned char EGR;
    unsigned char CCMR1;
    unsigned char CCMR2;
    unsigned char CCMR3;
    unsigned char CCMR4;
    unsigned char CCER1;
    unsigned char CCER2;
    unsigned char CNTRH;
    unsigned char CNTRL;
    unsigned char PSCRH;
    unsigned char PSCRL;
    unsigned char ARRH;
    unsigned char ARRL;
    unsigned char RCR;
    unsigned char CCR1H;
    unsigned char CCR1L;
    unsigned char CCR2H;
    unsigned char CCR2L;
    unsigned char CCR3H;
    unsigned char CCR3L;
    unsigned char CCR4H;
    unsigned char CCR4L;
    unsigned char BKR;
    unsigned char DTR;
    unsigned char OISR;
} PWM_STRUCT;

//#define     PWMA                    ((PWM_STRUCT volatile far *)0x7efec0)
//#define     PWMB                    ((PWM_STRUCT volatile far *)0x7efee0)

/////////////////////////////////////////////////
//7E:FD00H-7E:FDFFH
/////////////////////////////////////////////////

#define     P0INTE                  (*(unsigned char volatile far *)0x7efd00)
#define     P1INTE                  (*(unsigned char volatile far *)0x7efd01)
#define     P2INTE                  (*(unsigned char volatile far *)0x7efd02)
#define     P3INTE                  (*(unsigned char volatile far *)0x7efd03)
#define     P4INTE                  (*(unsigned char volatile far *)0x7efd04)
#define     P5INTE                  (*(unsigned char volatile far *)0x7efd05)
#define     P6INTE                  (*(unsigned char volatile far *)0x7efd06)
#define     P7INTE                  (*(unsigned char volatile far *)0x7efd07)
#define     P0INTF                  (*(unsigned char volatile far *)0x7efd10)
#define     P1INTF                  (*(unsigned char volatile far *)0x7efd11)
#define     P2INTF                  (*(unsigned char volatile far *)0x7efd12)
#define     P3INTF                  (*(unsigned char volatile far *)0x7efd13)
#define     P4INTF                  (*(unsigned char volatile far *)0x7efd14)
#define     P5INTF                  (*(unsigned char volatile far *)0x7efd15)
#define     P6INTF                  (*(unsigned char volatile far *)0x7efd16)
#define     P7INTF                  (*(unsigned char volatile far *)0x7efd17)
#define     P0IM0                   (*(unsigned char volatile far *)0x7efd20)
#define     P1IM0                   (*(unsigned char volatile far *)0x7efd21)
#define     P2IM0                   (*(unsigned char volatile far *)0x7efd22)
#define     P3IM0                   (*(unsigned char volatile far *)0x7efd23)
#define     P4IM0                   (*(unsigned char volatile far *)0x7efd24)
#define     P5IM0                   (*(unsigned char volatile far *)0x7efd25)
#define     P6IM0                   (*(unsigned char volatile far *)0x7efd26)
#define     P7IM0                   (*(unsigned char volatile far *)0x7efd27)
#define     P0IM1                   (*(unsigned char volatile far *)0x7efd30)
#define     P1IM1                   (*(unsigned char volatile far *)0x7efd31)
#define     P2IM1                   (*(unsigned char volatile far *)0x7efd32)
#define     P3IM1                   (*(unsigned char volatile far *)0x7efd33)
#define     P4IM1                   (*(unsigned char volatile far *)0x7efd34)
#define     P5IM1                   (*(unsigned char volatile far *)0x7efd35)
#define     P6IM1                   (*(unsigned char volatile far *)0x7efd36)
#define     P7IM1                   (*(unsigned char volatile far *)0x7efd37)
#define     P0WKUE                  (*(unsigned char volatile far *)0x7efd40)
#define     P1WKUE                  (*(unsigned char volatile far *)0x7efd41)
#define     P2WKUE                  (*(unsigned char volatile far *)0x7efd42)
#define     P3WKUE                  (*(unsigned char volatile far *)0x7efd43)
#define     P4WKUE                  (*(unsigned char volatile far *)0x7efd44)
#define     P5WKUE                  (*(unsigned char volatile far *)0x7efd45)
#define     P6WKUE                  (*(unsigned char volatile far *)0x7efd46)
#define     P7WKUE                  (*(unsigned char volatile far *)0x7efd47)

#define     PINIPL                  (*(unsigned char volatile far *)0x7efd60)
#define     PINIPH                  (*(unsigned char volatile far *)0x7efd61)

#define     UR1TOCR                 (*(unsigned char volatile far *)0x7efd70)
#define     UR1TOSR                 (*(unsigned char volatile far *)0x7efd71)
#define     UR1TOTH                 (*(unsigned char volatile far *)0x7efd72)
#define     UR1TOTL                 (*(unsigned char volatile far *)0x7efd73)
#define     UR2TOCR                 (*(unsigned char volatile far *)0x7efd74)
#define     UR2TOSR                 (*(unsigned char volatile far *)0x7efd75)
#define     UR2TOTH                 (*(unsigned char volatile far *)0x7efd76)
#define     UR2TOTL                 (*(unsigned char volatile far *)0x7efd77)
#define     UR3TOCR                 (*(unsigned char volatile far *)0x7efd78)
#define     UR3TOSR                 (*(unsigned char volatile far *)0x7efd79)
#define     UR3TOTH                 (*(unsigned char volatile far *)0x7efd7a)
#define     UR3TOTL                 (*(unsigned char volatile far *)0x7efd7b)
#define     UR4TOCR                 (*(unsigned char volatile far *)0x7efd7c)
#define     UR4TOSR                 (*(unsigned char volatile far *)0x7efd7d)
#define     UR4TOTH                 (*(unsigned char volatile far *)0x7efd7e)
#define     UR4TOTL                 (*(unsigned char volatile far *)0x7efd7f)
#define     SPITOCR                 (*(unsigned char volatile far *)0x7efd80)
#define     SPITOSR                 (*(unsigned char volatile far *)0x7efd81)
#define     SPITOTH                 (*(unsigned char volatile far *)0x7efd82)
#define     SPITOTL                 (*(unsigned char volatile far *)0x7efd83)
#define     I2CTOCR                 (*(unsigned char volatile far *)0x7efd84)
#define     I2CTOSR                 (*(unsigned char volatile far *)0x7efd85)
#define     I2CTOTH                 (*(unsigned char volatile far *)0x7efd86)
#define     I2CTOTL                 (*(unsigned char volatile far *)0x7efd87)

#define     I2SCR                   (*(unsigned char volatile far *)0x7efd98)
#define     I2SSR                   (*(unsigned char volatile far *)0x7efd99)
#define     I2SDRH                  (*(unsigned char volatile far *)0x7efd9a)
#define     I2SDRL                  (*(unsigned char volatile far *)0x7efd9b)
#define     I2SPRH                  (*(unsigned char volatile far *)0x7efd9c)
#define     I2SPRL                  (*(unsigned char volatile far *)0x7efd9d)
#define     I2SCFGH                 (*(unsigned char volatile far *)0x7efd9e)
#define     I2SCFGL                 (*(unsigned char volatile far *)0x7efd9f)
#define     I2SMD                   (*(unsigned char volatile far *)0x7efda0)

